examples/verification-validation/FTFF_Model.run_470um/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001; //all dimensions in mm

x0      3;     //electrode thickness (mm) 
y0      3;      //electrode length (mm)
z0      0.3;     //electrode width (mm)

x1      18;     //electrode thickness (mm) 
y1      20;      //electrode length (mm)
z1      1.9;     //electrode width (mm)

d_ch    0.5;       //channel depth (mm)
w_ch    1.0;       //channel width (mm)


delta_x   0.12;   //grid size x-direction (orig: 0.005)
delta_y   0.12;   //grid size y-direction (orig: 0.020)
delta_z   0.06;   //grid size z-direction (orig: 0.020)

nLx     #calc "round(($x1+$x0)/$delta_x)";            //no. of grid cells in x-direction (electrode)     
nLy     #calc "round(($y1+$y0)/$delta_y)";      //no. of grid cells in y-direction (electrode)
nLz     #calc "round(($z1+$z0)/$delta_z)";    //no. of grid cells in z-direction


vertices
(
    ( -$x0   -$y0   -$z0   ) //0
    ( $x1 -$y0   -$z0   ) //1
    ( $x1 $y1 -$z0   ) //2
    ( -$x0   $y1 -$z0   ) //3
    ( -$x0   -$y0   $z1 ) //4
    ( $x1 -$y0   $z1 ) //5
    ( $x1 $y1 $z1 ) //6
    ( -$x0   $y1 $z1 ) //7 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nLx $nLy $nLz) simpleGrading (1 1 1)        //electrode bulk (orig.)
);

/*
edges
(
);

boundary
(
    inlet //fluid inlet patch
    {
        type patch;
        faces
        (            
            (14 4 15 16) 
        );
    }
    
    outlet //fluid outlet patch
    {   type wall;
        faces
        (
            (3 12 11 13) 
        );
    }  

    btm //bottom patch = current collector
    {
        type wall;
        faces
        (
            (12 9 15 18)
            (11 12 18 17)
            (13 11 17 19)
            (3 7 19 13)
            (8 0 4 14)
            (10 8 14 16)
            (9 10 16 15)
        );
    }

    top //top patch = membrane
    {   type wall;
        faces
        (            
            (1 20 23 5)
            (20 21 22 23)
            (21 2 6 22)
        );
    }
    
    front //front patch
    {
        type wall;
        faces
        (
            (4 5 23 15)
            (15 23 22 18)
            (18 22 6 7)
            (17 18 7 19)
        );
    }    

    back //back patch
    {
        type wall;
        faces
        (
            (0 9 20 1)
            (9 12 21 20)
            (12 3 2 21)    
            (0 8 10 9)  
        );
    } 
    
    walls    
    {   type wall;
        faces
        (         
        (2 3 7 6)
        (0 1 5 4)
        );
    }
);


mergePatchPairs
(

);
*/
// ************************************************************************* //
