examples/verification-validation/FTFF_Model.run_470um/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;


//Physical parameters

nu              nu   [0 2 -1 0 0 0 0] 1.126e-6; //kinematic viscosity [m^2 / s] mu/rho

rho             rho  [1 -3 0 0 0 0 0] 1015; //fluid density [kg / m^3]

DCO             DCO  [0 2 -1 0 0 0 0] 4.8e-10; //diffusion coefficient of O [m^2 / s]

DCR             DCR  [0 2 -1 0 0 0 0] 5.7e-10; //diffusion coefficient of R [m^2 / s]

//kappa1          kappa1 [-1 -3 3 0 0 2 0] 102.5; //effective solid conductivity

kappa2          kappa2 [-1 -3 3 0 0 2 0] 34.84; //base liquid conductivity

//tau             tau [0 0 0 0 0 0 0]; //tortuosity

stdPotential    stdPotential [1 2 -3 0 0 -1 0] 0.771;

Temperature     Temperature [0 0 0 1 0 0 0] 293.5;

i0              i0 [0 -2 0 0 0 1 0] 165; //exchange current density [A / m^2]

CRef            CRef [0 -3 0 0 0 0 0] 250.; // CRef in mol / m^3, quanitity used to non-dim BV, shouldn't change

//i0              i0 [0 -2 0 0 0 1 0] 0.4438 ; //exchange current density [A / m^2]

//CRef            CRef [0 -3 0 0 0 0 0] 250.; // CRef in mol / m^3, quanitity used to non-dim BV, shouldn't change

alphaA          alphaA [0 0 0 0 0 0 0] 0.5;

alphaC          alphaC [0 0 0 0 0 0 0] 0.5;

nelec           nelec [0 0 0 0 0 0 0] 1;


// Mass transfer correlation: km_i = g_i *mag(Vel [m/s]))^ b_i [=] m/s

    // k_m Constants when using a simple correlation
    g_km          g_km [0 1 -1 0 0 0 0] 0.0011; //k_m prefactor
    b_km          b_km [0 0 0 0 0 0 0] 0.984; //k_m exponent
    
    // k_m Coefficients used in Beck's mesoscale correlation
    c1_km         c1_km [0 0 0 0 0 0 0] 0.468;
    c2_km         c2_km [0 0 0 0 0 0 0] 0.391;
    c3_km         c3_km [0 0 0 0 0 0 0] 0.4672;
    c4_km         c4_km [0 0 0 0 0 0 0] -0.1247;


//Subscale geometry parameters

unitCellLen     unitCellLen [0 1 0 0 0 0 0] 50e-6; // dimensions of unit cell in mesoscale simulations

printResLen     printResLen [0 1 0 0 0 0 0] 2.5e-6; // minimal rod radius in mesoscale simulations (printing resolution)



// ************************************************************************* //
