examples/verification-validation/FTFF_Model.run_470um/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


expressions
(
    porosity
    {
        field       porosity;
        dimensions  [0 0 0 0 0 0 0];

        constants
        {
            // Corner points of the rectangular region
            point1   (0 0 0); // First corner point
            point2   (0.015 0.017 0.00047); // Opposite corner point
            eps0     0.89;  // Lower porosity limit
            eps1     0.89;    // Upper porosity limit
        }

        variables
        (
            "x_min = min($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "x_max = max($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "y_min = min($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "y_max = max($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "z_min = min($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
            "z_max = max($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
        );

        fieldMask
        #{
            pos().x() >= x_min && pos().x() <= x_max &&
            pos().y() >= y_min && pos().y() <= y_max &&
            pos().z() >= z_min && pos().z() <= z_max
        #};

        expression
        #{
            (($[constants.eps1] - $[constants.eps0]) * (pos().y() - y_min) / (y_max - y_min)) + $[constants.eps0]
        #};
    }

        invPermeability
    {
        field       invPermeability;
        dimensions  [0 -2 0 0 0 0 0];

        constants
        {
            // Corner points of the rectangular region
            point1   (0 0 0); // First corner point
            point2   (0.015 0.017 0.00047); // Opposite corner point
            k0     9.18e10;  // Lower porosity limit
            k1     9.18e10;    // Upper porosity limit
        }

        variables
        (
            "x_min = min($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "x_max = max($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "y_min = min($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "y_max = max($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "z_min = min($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
            "z_max = max($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
        );

        fieldMask
        #{
            pos().x() >= x_min && pos().x() <= x_max &&
            pos().y() >= y_min && pos().y() <= y_max &&
            pos().z() >= z_min && pos().z() <= z_max
        #};

        expression
        #{
            (($[constants.k1] - $[constants.k0]) * (pos().y() - y_min) / (y_max - y_min)) + $[constants.k0]
        #};
    }


        kappa1
    {
        field       kappa1;
        dimensions  [-1 -3 3 0 0 2 0];

        constants
        {
            // Corner points of the rectangular region
            point1   (0 0 0); // First corner point
            point2   (0.015 0.017 0.00047); // Opposite corner point
            k0     275.78;  // Lower  limit
            k1     275.78;    // Upper  limit
        }

        variables
        (
            "x_min = min($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "x_max = max($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "y_min = min($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "y_max = max($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "z_min = min($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
            "z_max = max($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
        );

        fieldMask
        #{
            pos().x() >= x_min && pos().x() <= x_max &&
            pos().y() >= y_min && pos().y() <= y_max &&
            pos().z() >= z_min && pos().z() <= z_max
        #};

        expression
        #{
            (($[constants.k1] - $[constants.k0]) * (pos().y() - y_min) / (y_max - y_min)) + $[constants.k0]
        #};
    }

        areaPerVol
    {
        field       areaPerVol;
        dimensions  [0 -1 0 0 0 0 0];

        constants
        {
            // Corner points of the rectangular region
            point1   (0 0 0); // First corner point
            point2   (0.015 0.017 0.00047); // Opposite corner point
            k0     58225;  // Lower  limit
            k1     58225;    // Upper  limit
        }

        variables
        (
            "x_min = min($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "x_max = max($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "y_min = min($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "y_max = max($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "z_min = min($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
            "z_max = max($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
        );

        fieldMask
        #{
            pos().x() >= x_min && pos().x() <= x_max &&
            pos().y() >= y_min && pos().y() <= y_max &&
            pos().z() >= z_min && pos().z() <= z_max
        #};

        expression
        #{
            (($[constants.k1] - $[constants.k0]) * (pos().y() - y_min) / (y_max - y_min)) + $[constants.k0]
        #};
    }
    
    tau
    {
        field       tau;
        dimensions  [0 0 0 0 0 0 0];

        constants
        {
            // Corner points of the rectangular region
            point1   (0 0 0); // First corner point
            point2   (0.015 0.017 0.00047); // Opposite corner point
            k0     1.18;  // Lower  limit
            k1     1.18;    // Upper  limit
        }

        variables
        (
            "x_min = min($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "x_max = max($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "y_min = min($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "y_max = max($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "z_min = min($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
            "z_max = max($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
        );

        fieldMask
        #{
            pos().x() >= x_min && pos().x() <= x_max &&
            pos().y() >= y_min && pos().y() <= y_max &&
            pos().z() >= z_min && pos().z() <= z_max
        #};

        expression
        #{
            (($[constants.k1] - $[constants.k0]) * (pos().y() - y_min) / (y_max - y_min)) + $[constants.k0]
        #};
    }


);


// ************************************************************************* //
